datecol = {
    'stocklist': ['date', '發行日', '到期日', '上市日', '掛牌日', '公開發行日', '登錄日', '發布日']
}

# 這裡給的col欄位都是要清理過後的
numericol = {
    'stocklist': ['利率值'],
    '每日收盤行情': {
        "每日收盤行情": ['成交股數', '成交筆數', '成交金額', '開盤價', '最高價', '最低價', '收盤價', '漲跌價差', '最後揭示買價', '最後揭示買量', '最後揭示賣價', '最後揭示賣量', '本益比'],
        '報酬指數_臺灣證券交易所': ['收盤指數', '漲跌點數', '漲跌百分比%'],
        '報酬指數_臺灣指數公司': ['收盤指數', '漲跌點數', '漲跌百分比%'],
        "價格指數_臺灣證券交易所": ['收盤指數', '漲跌點數', '漲跌百分比%'],
        '大盤統計資訊': ["成交金額_元", "成交股數_股", '成交筆數'],
        '價格指數_跨市場': ['收盤指數', '漲跌點數', '漲跌百分比%'],
        '價格指數_臺灣指數公司': ['收盤指數', '漲跌點數', '漲跌百分比%'],
        '報酬指數_跨市場': ['收盤指數', '漲跌點數', '漲跌百分比%'],
    },
    "信用交易統計": {
        "融資融券彙總": ['資券互抵','融資_買進', '融資_賣出', '融資_現金償還', '融資_前日餘額', '融資_今日餘額',"融資_次一營業日餘額", '融資_限額', '融券_現券償還','融券_買進', '融券_賣出', '融券_前日餘額', '融券_今日餘額', '融券_限額',"融券_次一營業日餘額"],
        "信用交易統計": ['買進', '賣出', '現金券償還', '前日餘額', '今日餘額'],
    },
    '市場成交資訊': {
        '市場成交資訊': ['成交股數', '成交金額', '成交筆數', '發行量加權股價指數', '漲跌點數']
    },
    '三大法人買賣金額統計表': {
        '三大法人買賣金額統計表': ['買進金額', '賣出金額', '買賣差額']
    },
    '三大法人買賣超日報': {
        '三大法人買賣超日報': ["外陸資買進股數_不含外資自營商","外陸資賣出股數_不含外資自營商","外陸資買賣超股數_不含外資自營商","外資自營商買進股數","外資自營商賣出股數","外資自營商買賣超股數",'外資買進股數', '外資賣出股數', '外資買賣超股數', '投信買進股數', '投信賣出股數', '投信買賣超股數', '自營商買進股數', '自營商賣出股數', '自營商買賣超股數', '三大法人買賣超股數',"自營商買進股數_自行買賣","自營商賣出股數_自行買賣","自營商買賣超股數_自行買賣","自營商買進股數_避險","自營商賣出股數_避險","自營商買賣超股數_避險"]
    },
    '個股日本益比、殖利率及股價淨值比': {
        '個股日本益比、殖利率及股價淨值比': ['本益比', '殖利率%', '股價淨值比']
    },
    '信用額度總量管制餘額表': {
        '信用額度總量管制餘額表': ['融券_前日餘額', '融券_賣出', '融券_買進', '融券_現券', '融券_今日餘額', '融券_限額', '融券_次一營業日限額','借券賣出_前日餘額', '借券賣出_當日賣出', '借券賣出_當日還券', '借券賣出_當日調整', '借券賣出_當日餘額', '借券賣出_次一營業日可限額',"借券賣出_賣出","借券賣出_庫存異動","借券賣出_今日餘額","借券賣出_可使用額度"]
    },
    '當日沖銷交易標的及成交量值': {
        '當日沖銷交易統計資訊': ['當日沖銷交易總成交股數', '當日沖銷交易總成交股數占市場比重%', '當日沖銷交易總買進成交金額', '當日沖銷交易總買進成交金額占市場比重%', '當日沖銷交易總賣出成交金額', '當日沖銷交易總賣出成交金額占市場比重%'],
        '當日沖銷交易標的及成交量值': ['當日沖銷交易成交股數', '當日沖銷交易買進成交金額', '當日沖銷交易賣出成交金額'],
    },
    '每月當日沖銷交易標的及統計': {
        '每月當日沖銷交易標的及統計': ['當日沖銷交易總成交股數', '當日沖銷交易總成交股數占市場比重%', '當日沖銷交易總買進成交金額', '當日沖銷交易總買進成交金額占市場比重%', '當日沖銷交易總賣出成交金額', '當日沖銷交易總賣出成交金額占市場比重%']
    },
    '外資及陸資投資持股統計': {
        '外資及陸資投資持股統計': ["外資及陸資尚可投資股數","全體外資及陸資持有股數","外資及陸資共用法令投資上限比率","陸資法令投資上限比率","發行股數","外資及陸資尚可投資比率","全體外資及陸資持股比率", '外資尚可投資股數', '全體外資持有股數', '外資尚可投資比率', '全體外資持股比率', '法令投資上限比率']
    },
    '發行量加權股價指數歷史資料': {
        '發行量加權股價指數歷史資料': ['開盤指數', '最高指數', '最低指數', '收盤指數']
    },
}