
from .cleaning_types import type3, type4, type5, type6, type7, type8

fundic = {
    '每日收盤行情': {
        # '價格指數(臺灣證券交易所)': type1,
        # '價格指數(跨市場)': type1,
        # '價格指數(臺灣指數公司)': type1,
        # '報酬指數(臺灣證券交易所)': type1,
        # '報酬指數(跨市場)': type1,
        # '報酬指數(臺灣指數公司)': type1,
        # '大盤統計資訊': type1,
        # '每日收盤行情': type1,
    },
    '信用交易統計': {
        '融資融券彙總': type4,
        '信用交易統計': type3,
    },
    '市場成交資訊': {
        '市場成交資訊': type5
    },
    '三大法人買賣金額統計表': {
        # '三大法人買賣金額統計表': type1
    },
    '三大法人買賣超日報': {
        # '三大法人買賣超日報': type1
    },
    '個股日本益比、殖利率及股價淨值比': {
        # '個股日本益比、殖利率及股價淨值比': type1
    },
    '信用額度總量管制餘額表': {
        '信用額度總量管制餘額表': type6
    },
    '當日沖銷交易標的及成交量值': {
        '當日沖銷交易統計資訊': type7,
        '當日沖銷交易標的及成交量值': type7,
    },
    '每月當日沖銷交易標的及統計': {
        '每月當日沖銷交易標的及統計': type5,
    },
    '外資及陸資投資持股統計': {
        '外資及陸資投資持股統計': type8,
    },
    '發行量加權股價指數歷史資料': {
        '發行量加權股價指數歷史資料': type5
    },
}
